tests/load/artillery-config.yml
config:
  target: "http://localhost:5001"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up load"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"

  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 2000        # 95th percentile response time < 2000ms
    p99: 5000        # 99th percentile response time < 5000ms

  # HTTP configuration
  http:
    timeout: 10

  # Plugins
  plugins:
    metrics-by-endpoint:
      stripQueryString: true
    
  # Variables
  variables:
    baseUrl: "http://localhost:5001"

scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "healthStatus"

  # Monitoring health scenario
  - name: "Monitoring Health"
    weight: 10
    flow:
      - get:
          url: "/api/monitoring/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "health"

  # Marketplace scenarios
  - name: "Browse Marketplace"
    weight: 20
    flow:
      # Get categories
      - get:
          url: "/api/marketplace/categories"
          expect:
            - statusCode: 200
      
      # Get featured models
      - get:
          url: "/api/marketplace/models/featured?limit=10"
          expect:
            - statusCode: 200
      
      # Get top rated models
      - get:
          url: "/api/marketplace/models/top-rated?limit=10"
          expect:
            - statusCode: 200
      
      # Think time
      - think: 2

  # Orchestration scenarios
  - name: "List Workflow Templates"
    weight: 15
    flow:
      - get:
          url: "/api/orchestration/templates"
          # Note: This requires authentication
          # Add auth header when testing with real auth
          expect:
            - statusCode: [200, 401]

  # Streaming test scenario (SSE)
  - name: "Streaming Test"
    weight: 5
    flow:
      - get:
          url: "/api/streaming/test"
          expect:
            - statusCode: 200

  # Mixed workload scenario
  - name: "Mixed Workload"
    weight: 30
    flow:
      # Check health
      - get:
          url: "/health"
      
      # Browse marketplace
      - get:
          url: "/api/marketplace/models/featured"
      
      - think: 1
      
      # Check monitoring
      - get:
          url: "/api/monitoring/health"
      
      - think: 2
      
      # Search marketplace
      - get:
          url: "/api/marketplace/models/search?q=llama&limit=20"
      
      - think: 1

  # Stress test scenario
  - name: "Stress Test"
    weight: 10
    flow:
      # Rapid requests
      - loop:
          - get:
              url: "/health"
          - get:
              url: "/api/monitoring/health"
          - think: 0.1
        count: 10

  # Error handling scenario
  - name: "Error Handling"
    weight: 5
    flow:
      # Test 404
      - get:
          url: "/api/non-existent-endpoint"
          expect:
            - statusCode: 404
      
      # Test invalid endpoint
      - get:
          url: "/api/marketplace/models/invalid-id"
          expect:
            - statusCode: [404, 400]